RT-Thread/rt-thread/bsp/stm32/libraries/STM32MPxx_HAL/CMSIS/Device/ST/STM32MP1xx/Source/Templates/iar/startup_stm32mp15xx.s
;******************************************************************************
;* File Name          : startup_stm32mp15xx.s
;* Author             : MCD Application Team
;* Description        : STM32MP15xx devices vector table for EWARM toolchain.
;*                      This module performs:
;*                      - Set the initial SP
;*                      - Set the initial PC == __iar_program_start,
;*                      - Set the vector table entries with the exceptions ISR 
;*                        address
;*                      - Branches to main in the C library (which eventually
;*                        calls main()).
;*                      After Reset the CortexM4 processor is in Thread mode,
;*                      priority is Privileged, and the Stack is set to Main.
;******************************************************************************
;* @attention
;*
;* <h2><center>&copy; Copyright (c) 2019 STMicroelectronics. 
;* All rights reserved.</center></h2>
;*
;* This software component is licensed by ST under BSD 3-Clause license,
;* the "License"; You may not use this file except in compliance with the 
;* License. You may obtain a copy of the License at:
;*                        opensource.org/licenses/BSD-3-Clause
;*
;*******************************************************************************

//#define __DATA_IN_ExtSRAM 		 /* When External SRAM is used */ 
#ifdef __DATA_IN_ExtSRAM 
__initial_spTop EQU    0x20000400 		  ; stack used for SystemInit & SystemInit_ExtMemCtl 
#endif /*__DATA_IN_ExtSRAM*/  
	   MODULE  ?cstartup 

	  ;; Forward declaration of sections. 
	  SECTION CSTACK:DATA:NOROOT(3) 

	  SECTION .intvec:CODE:NOROOT(2)


	  EXTERN  __iar_program_start 
	  EXTERN  SystemInit 
	  PUBLIC  __vector_table 

	  DATA 

__vector_table 
#ifdef __DATA_IN_ExtSRAM 
 	  DCD     __initial_spTop 				   ; Use internal RAM for stack for calling SystemInit 
 #else 
 	  DCD     sfe(CSTACK) 
#endif /*__DATA_IN_ExtSRAM*/ 
 	  DCD     Reset_Handler      				                   ; Reset Handler  
 	  DCD     NMI_Handler        				                   ; NMI Handler 
 	  DCD     HardFault_Handler   				                   ; Hard Fault Handler 
 	  DCD     MemManage_Handler      				           ; MPU Fault Handler 
 	  DCD     BusFault_Handler       				           ; Bus Fault Handler 
 	  DCD     UsageFault_Handler    				           ; Usage Fault Handler 
 	  DCD     0         				                           ; Reserved 
 	  DCD     0                  				                   ; Reserved  
 	  DCD     0                  				                   ; Reserved 
 	  DCD     0                  				                   ; Reserved 
 	  DCD     SVC_Handler       				                   ; SVCall Handler 
 	  DCD     DebugMon_Handler  				                   ; Debug Monitor Handler 
 	  DCD     0                  				                   ; Reserved 
 	  DCD     PendSV_Handler    				                   ; PendSV Handler 
 	  DCD     SysTick_Handler    				                   ; SysTick Handler 

	 ; External Interrupts 
 	  DCD 				WWDG1_IRQHandler 			;
 	  DCD 				PVD_AVD_IRQHandler		        ;
 	  DCD 				TAMP_IRQHandler 			;
 	  DCD 				RTC_WKUP_ALARM_IRQHandler 	        ;
 	  DCD 				0 				        ;
 	  DCD 				RCC_IRQHandler 				;
 	  DCD 				EXTI0_IRQHandler 			;
 	  DCD 				EXTI1_IRQHandler 			;
 	  DCD 				EXTI2_IRQHandler 			;
 	  DCD 				EXTI3_IRQHandler 			;
 	  DCD 				EXTI4_IRQHandler 			;
 	  DCD 				DMA1_Stream0_IRQHandler 		;
 	  DCD 				DMA1_Stream1_IRQHandler 		;
 	  DCD 				DMA1_Stream2_IRQHandler 		;
 	  DCD 				DMA1_Stream3_IRQHandler 		;
 	  DCD 				DMA1_Stream4_IRQHandler 		;
 	  DCD 				DMA1_Stream5_IRQHandler 		;
 	  DCD 				DMA1_Stream6_IRQHandler 		;
 	  DCD 				ADC1_IRQHandler 			;
 	  DCD 				FDCAN1_IT0_IRQHandler 			;
 	  DCD 				FDCAN2_IT0_IRQHandler 			;
 	  DCD 				FDCAN1_IT1_IRQHandler 			;
 	  DCD 				FDCAN2_IT1_IRQHandler 			;
 	  DCD 				EXTI5_IRQHandler 			;
 	  DCD 				TIM1_BRK_IRQHandler 			;
 	  DCD 				TIM1_UP_IRQHandler 			;
 	  DCD 				TIM1_TRG_COM_IRQHandler 		;
 	  DCD 				TIM1_CC_IRQHandler 			;
 	  DCD 				TIM2_IRQHandler 			;
 	  DCD 				TIM3_IRQHandler 			;
 	  DCD 				TIM4_IRQHandler 			;
 	  DCD 				I2C1_EV_IRQHandler 			;
 	  DCD 				I2C1_ER_IRQHandler 			;
 	  DCD 				I2C2_EV_IRQHandler 			;
 	  DCD 				I2C2_ER_IRQHandler 			;
 	  DCD 				SPI1_IRQHandler 			;
 	  DCD 				SPI2_IRQHandler 			;
 	  DCD 				USART1_IRQHandler 			;
 	  DCD 				USART2_IRQHandler 			;
 	  DCD 				USART3_IRQHandler 			;
 	  DCD 				EXTI10_IRQHandler 			;
 	  DCD 				RTC_TIMESTAMP_IRQHandler 		;
 	  DCD 				EXTI11_IRQHandler 			;
 	  DCD 				TIM8_BRK_IRQHandler 		        ;
 	  DCD 				TIM8_UP_IRQHandler 		        ;
 	  DCD 				TIM8_TRG_COM_IRQHandler 		;
 	  DCD 				TIM8_CC_IRQHandler 			;
 	  DCD 				DMA1_Stream7_IRQHandler 		;
 	  DCD 				FMC_IRQHandler 				;
 	  DCD 				SDMMC1_IRQHandler 		        ;
 	  DCD 				TIM5_IRQHandler 		        ;
 	  DCD 				SPI3_IRQHandler 		        ;
 	  DCD 				UART4_IRQHandler 		        ;
 	  DCD 				UART5_IRQHandler 		        ;
 	  DCD 				TIM6_IRQHandler 		        ;
 	  DCD 				TIM7_IRQHandler 		        ;
 	  DCD 				DMA2_Stream0_IRQHandler 	        ;
 	  DCD 				DMA2_Stream1_IRQHandler 	        ;
 	  DCD 				DMA2_Stream2_IRQHandler 	        ;
 	  DCD 				DMA2_Stream3_IRQHandler 	        ;
 	  DCD 				DMA2_Stream4_IRQHandler 	        ;
 	  DCD 				ETH1_IRQHandler 			;
 	  DCD 				ETH1_WKUP_IRQHandler 			;
 	  DCD 				FDCAN_CAL_IRQHandler 			;
 	  DCD 				EXTI6_IRQHandler 			;
 	  DCD 				EXTI7_IRQHandler 			;
 	  DCD 				EXTI8_IRQHandler 			;
 	  DCD 				EXTI9_IRQHandler 			;
 	  DCD 				DMA2_Stream5_IRQHandler 		;
 	  DCD 				DMA2_Stream6_IRQHandler 		;
 	  DCD 				DMA2_Stream7_IRQHandler 		;
 	  DCD 				USART6_IRQHandler 			;
 	  DCD 				I2C3_EV_IRQHandler 			;
 	  DCD 				I2C3_ER_IRQHandler 			;
 	  DCD 				USBH_OHCI_IRQHandler 			;
 	  DCD 				USBH_EHCI_IRQHandler 			;
 	  DCD 				EXTI12_IRQHandler 			;
 	  DCD 				EXTI13_IRQHandler 			;
 	  DCD 				DCMI_IRQHandler 			;
 	  DCD 				CRYP1_IRQHandler 			;
 	  DCD 				HASH1_IRQHandler 			;
 	  DCD 				FPU_IRQHandler 				;
 	  DCD 				UART7_IRQHandler 			;
 	  DCD 				UART8_IRQHandler 			;
 	  DCD 				SPI4_IRQHandler 			;
 	  DCD 				SPI5_IRQHandler 			;
 	  DCD 				SPI6_IRQHandler 			;
 	  DCD 				SAI1_IRQHandler 			;
 	  DCD 				LTDC_IRQHandler 			;
 	  DCD 				LTDC_ER_IRQHandler 			;
 	  DCD 				ADC2_IRQHandler				;
 	  DCD 				SAI2_IRQHandler 			;
 	  DCD 				QUADSPI_IRQHandler 			;
 	  DCD 				LPTIM1_IRQHandler 			;
 	  DCD 				CEC_IRQHandler 				;
 	  DCD 				I2C4_EV_IRQHandler 			;
 	  DCD 				I2C4_ER_IRQHandler 			;
 	  DCD 				SPDIF_RX_IRQHandler 			;
 	  DCD 				OTG_IRQHandler	 		        ;
 	  DCD 				0 				        ;
 	  DCD 				IPCC_RX0_IRQHandler 			;
 	  DCD 				IPCC_TX0_IRQHandler 			;
 	  DCD 				DMAMUX1_OVR_IRQHandler		        ;
 	  DCD 				IPCC_RX1_IRQHandler 			;
 	  DCD 				IPCC_TX1_IRQHandler 			;
 	  DCD 				CRYP2_IRQHandler 			;
 	  DCD 				HASH2_IRQHandler 			;
 	  DCD 				I2C5_EV_IRQHandler 			;
 	  DCD 				I2C5_ER_IRQHandler 			;
 	  DCD 				GPU_IRQHandler	 			;
 	  DCD 				DFSDM1_FLT0_IRQHandler 			;
 	  DCD 				DFSDM1_FLT1_IRQHandler 			;
 	  DCD 				DFSDM1_FLT2_IRQHandler 			;
 	  DCD 				DFSDM1_FLT3_IRQHandler 			;
 	  DCD 				SAI3_IRQHandler 			;
 	  DCD 				DFSDM1_FLT4_IRQHandler 			;
 	  DCD 				TIM15_IRQHandler 			;
 	  DCD 				TIM16_IRQHandler 			;
 	  DCD 				TIM17_IRQHandler 			;
      DCD 				TIM12_IRQHandler 			;
 	  DCD 				MDIOS_IRQHandler 			;
 	  DCD 				EXTI14_IRQHandler 			;
 	  DCD 				MDMA_IRQHandler 			;
 	  DCD 				DSI_IRQHandler 				;
 	  DCD 				SDMMC2_IRQHandler 			;
 	  DCD 				HSEM_IT2_IRQHandler			;
 	  DCD 				DFSDM1_FLT5_IRQHandler 			;
 	  DCD 				EXTI15_IRQHandler	 			;
 	  DCD 				nCTIIRQ1_IRQHandler 			;
 	  DCD 				nCTIIRQ2_IRQHandler 			;
  	  DCD 				TIM13_IRQHandler 			    ;
  	  DCD 				TIM14_IRQHandler 	            ;
  	  DCD 				DAC_IRQHandler 		            ;
  	  DCD 				RNG1_IRQHandler 	            ;
  	  DCD 				RNG2_IRQHandler 	            ;
 	  DCD 				I2C6_EV_IRQHandler 				;
 	  DCD 				I2C6_ER_IRQHandler 				;
 	  DCD 				SDMMC3_IRQHandler 				;
 	  DCD 				LPTIM2_IRQHandler 				;
 	  DCD 				LPTIM3_IRQHandler 				;
 	  DCD 				LPTIM4_IRQHandler 				;
 	  DCD 				LPTIM5_IRQHandler 				;
 	  DCD 				ETH1_LPI_IRQHandler 			;
 	  DCD 				0 				                ;
 	  DCD 				MPU_SEV_IRQHandler 				;
 	  DCD 				RCC_WAKEUP_IRQHandler           ;
 	  DCD 				SAI4_IRQHandler 				;
 	  DCD 				DTS_IRQHandler	 				;
 	  DCD 				0					 			;
 	  DCD 				WAKEUP_PIN_IRQHandler 		    ;

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; 
;;
;; Default interrupt handlers. 
;; 
	 THUMB 
	 PUBWEAK Reset_Handler 
	 SECTION .text:CODE:NOROOT:REORDER(2) 
Reset_Handler 

                      LDR     R0, =SystemInit 
          BLX     R0 
          LDR     R0, =__iar_program_start 
          BLX     R0 

	  PUBWEAK NMI_Handler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
NMI_Handler 
	  B NMI_Handler 

	  PUBWEAK HardFault_Handler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
HardFault_Handler 
	  B HardFault_Handler 

	  PUBWEAK MemManage_Handler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
MemManage_Handler 
	  B MemManage_Handler

	  PUBWEAK BusFault_Handler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
BusFault_Handler 
	  B BusFault_Handler 

