RT-Thread/rt-thread/bsp/stm32/libraries/STM32MPxx_HAL/CMSIS/Device/ST/STM32MP1xx/Source/Templates/iar/startup_stm32mp15xx.s
	  PUBWEAK UsageFault_Handler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
UsageFault_Handler 
	  B UsageFault_Handler 

	  PUBWEAK SVC_Handler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
SVC_Handler 
	  B SVC_Handler 

	  PUBWEAK DebugMon_Handler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DebugMon_Handler 
	  B DebugMon_Handler 

	  PUBWEAK PendSV_Handler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
PendSV_Handler 
	  B PendSV_Handler 

	  PUBWEAK SysTick_Handler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
SysTick_Handler 
	  B SysTick_Handler 

	  PUBWEAK WWDG1_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
WWDG1_IRQHandler  
 	  B  WWDG1_IRQHandler 

	  PUBWEAK PVD_AVD_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
PVD_AVD_IRQHandler  
 	  B  PVD_AVD_IRQHandler 

	  PUBWEAK TAMP_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
TAMP_IRQHandler  
 	  B  TAMP_IRQHandler 

	  PUBWEAK RTC_WKUP_ALARM_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
RTC_WKUP_ALARM_IRQHandler  
 	  B  RTC_WKUP_ALARM_IRQHandler 

	  PUBWEAK RCC_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
RCC_IRQHandler  
 	  B  RCC_IRQHandler 

	  PUBWEAK EXTI0_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
EXTI0_IRQHandler  
 	  B  EXTI0_IRQHandler 

	  PUBWEAK EXTI1_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
EXTI1_IRQHandler  
 	  B  EXTI1_IRQHandler 

	  PUBWEAK EXTI2_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
EXTI2_IRQHandler  
 	  B  EXTI2_IRQHandler 

	  PUBWEAK EXTI3_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
EXTI3_IRQHandler  
 	  B  EXTI3_IRQHandler 

	  PUBWEAK EXTI4_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
EXTI4_IRQHandler  
 	  B  EXTI4_IRQHandler 

	  PUBWEAK DMA1_Stream0_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DMA1_Stream0_IRQHandler  
 	  B  DMA1_Stream0_IRQHandler 

	  PUBWEAK DMA1_Stream1_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DMA1_Stream1_IRQHandler  
 	  B  DMA1_Stream1_IRQHandler 

	  PUBWEAK DMA1_Stream2_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DMA1_Stream2_IRQHandler  
 	  B  DMA1_Stream2_IRQHandler 

	  PUBWEAK DMA1_Stream3_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DMA1_Stream3_IRQHandler  
 	  B  DMA1_Stream3_IRQHandler 

	  PUBWEAK DMA1_Stream4_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DMA1_Stream4_IRQHandler  
 	  B  DMA1_Stream4_IRQHandler 

	  PUBWEAK DMA1_Stream5_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DMA1_Stream5_IRQHandler  
 	  B  DMA1_Stream5_IRQHandler 

	  PUBWEAK DMA1_Stream6_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DMA1_Stream6_IRQHandler  
 	  B  DMA1_Stream6_IRQHandler 

	  PUBWEAK ADC1_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
ADC1_IRQHandler  
 	  B  ADC1_IRQHandler 

	  PUBWEAK FDCAN1_IT0_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
FDCAN1_IT0_IRQHandler  
 	  B  FDCAN1_IT0_IRQHandler 

	  PUBWEAK FDCAN2_IT0_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
FDCAN2_IT0_IRQHandler  
 	  B  FDCAN2_IT0_IRQHandler 

	  PUBWEAK FDCAN1_IT1_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
FDCAN1_IT1_IRQHandler  
 	  B  FDCAN1_IT1_IRQHandler 

	  PUBWEAK FDCAN2_IT1_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
FDCAN2_IT1_IRQHandler  
 	  B  FDCAN2_IT1_IRQHandler 

	  PUBWEAK EXTI5_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
EXTI5_IRQHandler  
 	  B  EXTI5_IRQHandler 

	  PUBWEAK TIM1_BRK_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
TIM1_BRK_IRQHandler  
 	  B  TIM1_BRK_IRQHandler 

	  PUBWEAK TIM1_UP_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
TIM1_UP_IRQHandler  
 	  B  TIM1_UP_IRQHandler 

	  PUBWEAK TIM1_TRG_COM_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
TIM1_TRG_COM_IRQHandler  
 	  B  TIM1_TRG_COM_IRQHandler 

	  PUBWEAK TIM1_CC_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
TIM1_CC_IRQHandler  
 	  B  TIM1_CC_IRQHandler 

	  PUBWEAK TIM2_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
TIM2_IRQHandler  
 	  B  TIM2_IRQHandler 

	  PUBWEAK TIM3_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
TIM3_IRQHandler  
 	  B  TIM3_IRQHandler 

	  PUBWEAK TIM4_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
TIM4_IRQHandler  
 	  B  TIM4_IRQHandler 

	  PUBWEAK I2C1_EV_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
I2C1_EV_IRQHandler  
 	  B  I2C1_EV_IRQHandler 

	  PUBWEAK I2C1_ER_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
I2C1_ER_IRQHandler  
 	  B  I2C1_ER_IRQHandler 

	  PUBWEAK I2C2_EV_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
I2C2_EV_IRQHandler  
 	  B  I2C2_EV_IRQHandler 

	  PUBWEAK I2C2_ER_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
I2C2_ER_IRQHandler  
 	  B  I2C2_ER_IRQHandler 

	  PUBWEAK SPI1_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
SPI1_IRQHandler  
 	  B  SPI1_IRQHandler 

	  PUBWEAK SPI2_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
SPI2_IRQHandler  
 	  B  SPI2_IRQHandler 

	  PUBWEAK USART1_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
USART1_IRQHandler  
 	  B  USART1_IRQHandler 

	  PUBWEAK USART2_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
USART2_IRQHandler  
 	  B  USART2_IRQHandler 

	  PUBWEAK USART3_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
USART3_IRQHandler  
 	  B  USART3_IRQHandler 

	  PUBWEAK EXTI10_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
EXTI10_IRQHandler  
 	  B  EXTI10_IRQHandler 

	  PUBWEAK RTC_TIMESTAMP_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
RTC_TIMESTAMP_IRQHandler  
 	  B  RTC_TIMESTAMP_IRQHandler 

	  PUBWEAK EXTI11_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
EXTI11_IRQHandler  
 	  B  EXTI11_IRQHandler 

	  PUBWEAK TIM8_BRK_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
TIM8_BRK_IRQHandler  
 	  B  TIM8_BRK_IRQHandler 

	  PUBWEAK TIM8_UP_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
TIM8_UP_IRQHandler  
 	  B  TIM8_UP_IRQHandler 

	  PUBWEAK TIM8_TRG_COM_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
TIM8_TRG_COM_IRQHandler  
 	  B  TIM8_TRG_COM_IRQHandler 

	  PUBWEAK TIM8_CC_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
TIM8_CC_IRQHandler  
 	  B  TIM8_CC_IRQHandler 

	  PUBWEAK DMA1_Stream7_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DMA1_Stream7_IRQHandler  
 	  B  DMA1_Stream7_IRQHandler 

	  PUBWEAK FMC_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
FMC_IRQHandler  
 	  B  FMC_IRQHandler 

	  PUBWEAK SDMMC1_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
SDMMC1_IRQHandler  
 	  B  SDMMC1_IRQHandler 

