RT-Thread/rt-thread/bsp/stm32/libraries/STM32MPxx_HAL/CMSIS/Device/ST/STM32MP1xx/Source/Templates/iar/startup_stm32mp15xx.s
	  PUBWEAK TIM5_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
TIM5_IRQHandler  
 	  B  TIM5_IRQHandler 

	  PUBWEAK SPI3_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
SPI3_IRQHandler  
 	  B  SPI3_IRQHandler 

	  PUBWEAK UART4_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
UART4_IRQHandler  
 	  B  UART4_IRQHandler 

	  PUBWEAK UART5_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
UART5_IRQHandler  
 	  B  UART5_IRQHandler 

	  PUBWEAK TIM6_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
TIM6_IRQHandler  
 	  B  TIM6_IRQHandler 

	  PUBWEAK TIM7_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
TIM7_IRQHandler  
 	  B  TIM7_IRQHandler 

	  PUBWEAK DMA2_Stream0_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DMA2_Stream0_IRQHandler  
 	  B  DMA2_Stream0_IRQHandler 

	  PUBWEAK DMA2_Stream1_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DMA2_Stream1_IRQHandler  
 	  B  DMA2_Stream1_IRQHandler 

	  PUBWEAK DMA2_Stream2_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DMA2_Stream2_IRQHandler  
 	  B  DMA2_Stream2_IRQHandler 

	  PUBWEAK DMA2_Stream3_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DMA2_Stream3_IRQHandler  
 	  B  DMA2_Stream3_IRQHandler 

	  PUBWEAK DMA2_Stream4_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DMA2_Stream4_IRQHandler  
 	  B  DMA2_Stream4_IRQHandler 

	  PUBWEAK ETH1_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
ETH1_IRQHandler  
 	  B  ETH1_IRQHandler 

	  PUBWEAK ETH1_WKUP_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
ETH1_WKUP_IRQHandler  
 	  B  ETH1_WKUP_IRQHandler 

	  PUBWEAK ETH1_LPI_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
ETH1_LPI_IRQHandler  
 	  B  ETH1_LPI_IRQHandler 
	  
	  PUBWEAK FDCAN_CAL_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
FDCAN_CAL_IRQHandler  
 	  B  FDCAN_CAL_IRQHandler 

	  PUBWEAK EXTI6_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
EXTI6_IRQHandler  
 	  B  EXTI6_IRQHandler 

	  PUBWEAK EXTI7_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
EXTI7_IRQHandler  
 	  B  EXTI7_IRQHandler 

	  PUBWEAK EXTI8_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
EXTI8_IRQHandler  
 	  B  EXTI8_IRQHandler 

	  PUBWEAK EXTI9_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
EXTI9_IRQHandler  
 	  B  EXTI9_IRQHandler 

	  PUBWEAK DMA2_Stream5_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DMA2_Stream5_IRQHandler  
 	  B  DMA2_Stream5_IRQHandler 

	  PUBWEAK DMA2_Stream6_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DMA2_Stream6_IRQHandler  
 	  B  DMA2_Stream6_IRQHandler 

	  PUBWEAK DMA2_Stream7_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DMA2_Stream7_IRQHandler  
 	  B  DMA2_Stream7_IRQHandler 

	  PUBWEAK USART6_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
USART6_IRQHandler  
 	  B  USART6_IRQHandler 

	  PUBWEAK I2C3_EV_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
I2C3_EV_IRQHandler  
 	  B  I2C3_EV_IRQHandler 

	  PUBWEAK I2C3_ER_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
I2C3_ER_IRQHandler  
 	  B  I2C3_ER_IRQHandler 

	  PUBWEAK USBH_OHCI_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
USBH_OHCI_IRQHandler  
 	  B  USBH_OHCI_IRQHandler 

	  PUBWEAK USBH_EHCI_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
USBH_EHCI_IRQHandler  
 	  B  USBH_EHCI_IRQHandler 

	  PUBWEAK EXTI12_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
EXTI12_IRQHandler  
 	  B  EXTI12_IRQHandler 

	  PUBWEAK EXTI13_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
EXTI13_IRQHandler  
 	  B  EXTI13_IRQHandler 

	  PUBWEAK DCMI_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DCMI_IRQHandler  
 	  B  DCMI_IRQHandler 

	  PUBWEAK CRYP1_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
CRYP1_IRQHandler  
 	  B  CRYP1_IRQHandler 

	  PUBWEAK HASH1_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
HASH1_IRQHandler  
 	  B  HASH1_IRQHandler 

	  PUBWEAK FPU_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
FPU_IRQHandler  
 	  B  FPU_IRQHandler 

	  PUBWEAK UART7_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
UART7_IRQHandler  
 	  B  UART7_IRQHandler 

	  PUBWEAK UART8_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
UART8_IRQHandler  
 	  B  UART8_IRQHandler 

	  PUBWEAK SPI4_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
SPI4_IRQHandler  
 	  B  SPI4_IRQHandler 

	  PUBWEAK SPI5_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
SPI5_IRQHandler  
 	  B  SPI5_IRQHandler 

	  PUBWEAK SPI6_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
SPI6_IRQHandler  
 	  B  SPI6_IRQHandler 

	  PUBWEAK SAI1_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
SAI1_IRQHandler  
 	  B  SAI1_IRQHandler 

	  PUBWEAK LTDC_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
LTDC_IRQHandler  
 	  B  LTDC_IRQHandler 

	  PUBWEAK LTDC_ER_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
LTDC_ER_IRQHandler  
 	  B  LTDC_ER_IRQHandler 

	  PUBWEAK ADC2_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
ADC2_IRQHandler  
 	  B  ADC2_IRQHandler 

	  PUBWEAK SAI2_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
SAI2_IRQHandler  
 	  B  SAI2_IRQHandler 

	  PUBWEAK QUADSPI_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
QUADSPI_IRQHandler  
 	  B  QUADSPI_IRQHandler 

	  PUBWEAK LPTIM1_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
LPTIM1_IRQHandler  
 	  B  LPTIM1_IRQHandler 

	  PUBWEAK CEC_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
CEC_IRQHandler  
 	  B  CEC_IRQHandler 

	  PUBWEAK I2C4_EV_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
I2C4_EV_IRQHandler  
 	  B  I2C4_EV_IRQHandler 

	  PUBWEAK I2C4_ER_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
I2C4_ER_IRQHandler  
 	  B  I2C4_ER_IRQHandler 

	  PUBWEAK SPDIF_RX_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
SPDIF_RX_IRQHandler  
 	  B  SPDIF_RX_IRQHandler 

	  PUBWEAK OTG_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
OTG_IRQHandler  
 	  B  OTG_IRQHandler 

	  PUBWEAK IPCC_RX0_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
IPCC_RX0_IRQHandler  
 	  B  IPCC_RX0_IRQHandler 

	  PUBWEAK IPCC_TX0_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
IPCC_TX0_IRQHandler  
 	  B  IPCC_TX0_IRQHandler 

	  PUBWEAK DMAMUX1_OVR_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DMAMUX1_OVR_IRQHandler  
 	  B  DMAMUX1_OVR_IRQHandler 

	  PUBWEAK IPCC_RX1_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
IPCC_RX1_IRQHandler  
 	  B  IPCC_RX1_IRQHandler 

	  PUBWEAK IPCC_TX1_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
IPCC_TX1_IRQHandler  
 	  B  IPCC_TX1_IRQHandler 

	  PUBWEAK CRYP2_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
CRYP2_IRQHandler  
 	  B  CRYP2_IRQHandler 

