RT-Thread/rt-thread/bsp/stm32/libraries/STM32MPxx_HAL/CMSIS/Device/ST/STM32MP1xx/Source/Templates/iar/startup_stm32mp15xx.s
	  PUBWEAK HASH2_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
HASH2_IRQHandler  
 	  B  HASH2_IRQHandler 

	  PUBWEAK I2C5_EV_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
I2C5_EV_IRQHandler  
 	  B  I2C5_EV_IRQHandler 

	  PUBWEAK I2C5_ER_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
I2C5_ER_IRQHandler  
 	  B  I2C5_ER_IRQHandler 

	  PUBWEAK GPU_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
GPU_IRQHandler  
 	  B  GPU_IRQHandler 

	  PUBWEAK DFSDM1_FLT0_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DFSDM1_FLT0_IRQHandler  
 	  B  DFSDM1_FLT0_IRQHandler 

	  PUBWEAK DFSDM1_FLT1_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DFSDM1_FLT1_IRQHandler  
 	  B  DFSDM1_FLT1_IRQHandler 

	  PUBWEAK DFSDM1_FLT2_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DFSDM1_FLT2_IRQHandler  
 	  B  DFSDM1_FLT2_IRQHandler 

	  PUBWEAK DFSDM1_FLT3_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DFSDM1_FLT3_IRQHandler  
 	  B  DFSDM1_FLT3_IRQHandler 

	  PUBWEAK SAI3_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
SAI3_IRQHandler  
 	  B  SAI3_IRQHandler 

	  PUBWEAK DFSDM1_FLT4_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DFSDM1_FLT4_IRQHandler  
 	  B  DFSDM1_FLT4_IRQHandler 

	  PUBWEAK TIM15_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
TIM15_IRQHandler  
 	  B  TIM15_IRQHandler 

	  PUBWEAK TIM16_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
TIM16_IRQHandler  
 	  B  TIM16_IRQHandler 

	  PUBWEAK TIM17_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
TIM17_IRQHandler  
 	  B  TIM17_IRQHandler 
          
          	  PUBWEAK TIM12_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
TIM12_IRQHandler  
 	  B  TIM12_IRQHandler 

	  PUBWEAK MDIOS_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
MDIOS_IRQHandler  
 	  B  MDIOS_IRQHandler 

	  PUBWEAK EXTI14_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
EXTI14_IRQHandler  
 	  B  EXTI14_IRQHandler 

	  PUBWEAK MDMA_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
MDMA_IRQHandler  
 	  B  MDMA_IRQHandler 

	  PUBWEAK DSI_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DSI_IRQHandler  
 	  B  DSI_IRQHandler 

	  PUBWEAK SDMMC2_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
SDMMC2_IRQHandler  
 	  B  SDMMC2_IRQHandler 

	  PUBWEAK HSEM_IT2_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
HSEM_IT2_IRQHandler  
 	  B  HSEM_IT2_IRQHandler
      
      PUBWEAK DFSDM1_FLT5_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DFSDM1_FLT5_IRQHandler  
 	  B  DFSDM1_FLT5_IRQHandler 
      
      PUBWEAK nCTIIRQ1_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
nCTIIRQ1_IRQHandler  
 	  B  nCTIIRQ1_IRQHandler 
      
      PUBWEAK nCTIIRQ2_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
nCTIIRQ2_IRQHandler  
 	  B  nCTIIRQ2_IRQHandler 
            
	  PUBWEAK EXTI15_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
EXTI15_IRQHandler  
 	  B  EXTI15_IRQHandler 

   	  PUBWEAK TIM13_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
TIM13_IRQHandler  
 	  B  TIM13_IRQHandler
          
   	  PUBWEAK TIM14_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
TIM14_IRQHandler  
 	  B  TIM14_IRQHandler  

       	  PUBWEAK DAC_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DAC_IRQHandler  
 	  B  DAC_IRQHandler        
          
       	  PUBWEAK RNG1_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
RNG1_IRQHandler  
 	  B  RNG1_IRQHandler        

       	  PUBWEAK RNG2_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
RNG2_IRQHandler  
 	  B  RNG2_IRQHandler        

          PUBWEAK I2C6_EV_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
I2C6_EV_IRQHandler  
 	  B  I2C6_EV_IRQHandler 

	  PUBWEAK I2C6_ER_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
I2C6_ER_IRQHandler  
 	  B  I2C6_ER_IRQHandler

	  PUBWEAK SDMMC3_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
SDMMC3_IRQHandler  
 	  B  SDMMC3_IRQHandler 

	  PUBWEAK LPTIM2_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
LPTIM2_IRQHandler  
 	  B  LPTIM2_IRQHandler 

	  PUBWEAK LPTIM3_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
LPTIM3_IRQHandler  
 	  B  LPTIM3_IRQHandler 

	  PUBWEAK LPTIM4_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
LPTIM4_IRQHandler  
 	  B  LPTIM4_IRQHandler 

	  PUBWEAK LPTIM5_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
LPTIM5_IRQHandler  
 	  B  LPTIM5_IRQHandler 

	  PUBWEAK MPU_SEV_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
MPU_SEV_IRQHandler  
 	  B  MPU_SEV_IRQHandler 

	  PUBWEAK RCC_WAKEUP_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
RCC_WAKEUP_IRQHandler  
 	  B  RCC_WAKEUP_IRQHandler 
      
	  PUBWEAK SAI4_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
SAI4_IRQHandler  
 	  B  SAI4_IRQHandler 

	  PUBWEAK DTS_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
DTS_IRQHandler  
 	  B  DTS_IRQHandler 

	  PUBWEAK WAKEUP_PIN_IRQHandler 
	  SECTION .text:CODE:NOROOT:REORDER(1) 
WAKEUP_PIN_IRQHandler  
 	  B  WAKEUP_PIN_IRQHandler 

	 END 
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/